<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Do the Munki Thing for KDiff3</string>
    <key>Identifier</key>
    <string>com.github.slangdaddy.munki.kdiff3</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>utilities/kdiff3</string>
        <key>NAME</key>
        <string>kdiff3</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>KDiff3</string>
            <key>display_name</key>
            <string>KDiff3</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>category</key>
            <string>Utilities</string>
            <key>unattended_install</key>
            <true/>
	    <key>preinstall_script</key>
	    <string>#!/bin/sh
if [ -e "/Applications/KDiff3.localized" ]; then
rm -r "/Applications/KDiff3.localized"
fi
if [ -e "/Applications/kdiff3.app" ]; then
rm -r "/Applications/kdiff3.app"
fi
exit 0
            </string>
	    <key>postuninstall_script</key>
	    <string>#!/bin/sh
if [ -e "/Applications/KDiff3.localized" ]; then
rm -r "/Applications/KDiff3.localized"
fi
if [ -e "/Applications/kdiff3.app" ]; then
rm -r "/Applications/kdiff3.app"
fi
exit 0
            </string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.2</string>
    <key>ParentRecipe</key>
    <string>com.github.slangdaddy.pkg.kdiff3</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
