<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Package KDiff3</string>
    <key>Identifier</key>
    <string>com.github.slangdaddy.pkg.kdiff3</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>kdiff3</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.slangdaddy.download.kdiff3</string>
    <key>MinimumVersion</key>
    <string>0.4.2</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
		<key>pkgdirs</key>
		<dict>
		    <key>Applications</key>
		    <string>0775</string>
		    <key>etc</key>
		    <string>0775</string>
		    <key>etc/paths.d</key>
		    <string>0775</string>
		</dict>
            </dict>
        </dict>
	<!-- Copy App to Applications -->
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%/KDiff3.app</string>
                <key>destination_path</key>
                <string>%pkgroot%/Applications/KDiff3.app</string>
            </dict>
        </dict>
	<!-- paths.d -->
        <dict>
            <key>Processor</key>
            <string>FileCreator</string>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
                <string>%pkgroot%/etc/paths.d/kdiff3</string>
                <key>file_content</key>
                <string>/Applications/KDiff3.app/Contents/MacOS</string>
                <key>file_mode</key>
                <string>0755</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>pkgname</key>
                    <string>%NAME%-%version%</string>
                    <key>version</key>
                    <string>%version%</string>
                    <key>id</key>
                    <string>org.kde.kdiff3</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>Applications</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                        <dict>
                            <key>path</key>
                            <string>etc</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                        <dict>
                            <key>path</key>
                            <string>etc/paths.d/kdiff3</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                            <key>mode</key>
                            <string>0644</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>
