<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads KDiff3</string>
    <key>Identifier</key>
    <string>com.github.slangdaddy.download.kdiff3</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>kdiff3</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.2</string>
    <key>Process</key>
    <array>
        <dict>
		<key>Arguments</key>
		<dict>
			<key>re_pattern</key>
			<string>href="(?P&lt;filename&gt;[^\"]*-macos-64.dmg)">kdiff3-(?P&lt;version&gt;[0-9\.]+)-macos-64.dmg</string>
			<key>url</key>
			<string>https://download.kde.org/stable/kdiff3/</string>
		</dict>
		<key>Processor</key>
		<string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%filename%</string>
                <key>url</key>
                <string>https://download.kde.org/stable/kdiff3/%filename%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
