<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of VagrantVMwareUtility and imports into a Munki repo.</string>
    <key>Identifier</key>
    <string>com.github.slangdaddy.munki.VagrantVMwareUtility</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>VagrantVMwareUtility</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>utilities/vagrant-vmware-utility</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>This tool is needed to install the Vagrant VMware Desktop Provider</string>
            <key>display_name</key>
            <string>Vagrant VMware Utility</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>category</key>
            <string>Utilities</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.slangdaddy.download.VagrantVMwareUtility</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
